
int lenghtSM=int.Parse(Console.ReadLine());
int widhtSM=int.Parse(Console.ReadLine());
int heidhtSM=int.Parse(Console.ReadLine());
double procent=double.Parse(Console.ReadLine());

double volum=lenghtSM*widhtSM*heidhtSM;


double liters = volum/1000;
double litersNeed = liters * (1 - (procent/100));
Console.WriteLine(litersNeed);

//(AB + AC + BC)

//За рождения си ден Любомир получил аквариум с формата на паралелепипед. 
//    Първоначално прочитаме от конзолата на отделни редове размерите му 
//    – дължина, широчина и височина в сантиметри. 
//    Трябва да се пресметне колко литра вода ще събира аквариума,
//    ако се знае, че определен процент от вместимостта му е заета от пясък, растения, нагревател и помпа. 
//Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм3/. 
//Да се напише програма, която изчислява литрите вода, която са необходими за напълването на аквариума.

//Изход
//Да се отпечата на конзолата едно число:
//•	литрите вода, които ще  събира аквариума.

